# SkyBackgroundSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SkyBackgroundSettings Class
Members See Also
---
Represents the rendering sky background settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class SkyBackgroundSettings : BackgroundSettings
```

Visual Basic
---
```text
Public Class SkyBackgroundSettings _
	Inherits BackgroundSettings
```

Visual C++
---
```text
public ref class SkyBackgroundSettings : public BackgroundSettings
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BackgroundSettings Autodesk.Revit.DB..::..SkyBackgroundSettings
# See Also
SkyBackgroundSettings Members
Autodesk.Revit.DB Namespace